Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/lunyu__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 子曰：「能以禮讓爲國乎，何有？不能以禮讓爲國，如禮何？」
en: The Master said, "If a prince is able to govern his kingdom with the complaisance proper to the rules of propriety, what difficulty will he have? If he cannot govern it with that complaisance, what has he to do with the rules of propriety?"

source: 子曰：「不患無位，患所以立。不患莫己知，未爲可知也。」
en: The Master said, "A man should say, I am not concerned that I have no place, I am concerned how I may fit myself for one. I am not concerned that I am not known, I seek to be worthy to be known."

source: 子曰：「參乎！吾道一以貫之。」曾子曰：「唯。」子出，門人問曰：「何謂也？」曾子曰：「夫子之道，忠恕而已矣！」
en: The Master said, "Shan, my doctrine is that of an all-pervading unity." The disciple Tsang replied, "Yes." The Master went out, and the other disciples asked, saying, "What do his words mean?" Tsang said, "The doctrine of our master is to be true to the principles of our nature and the benevolent exercise of them to others,—this and nothing more."

source: 子曰：「君子喻於義，小人喻於利。」
en: The Master said, "The mind of the superior man is conversant with righteousness; the mind of the mean man is conversant with gain."

source: 子曰：「見賢思齊焉，見不賢而內自省也。」
en: The Master said, "When we see men of worth, we should think of equalling them; when we see men of a contrary character, we should turn inwards and examine ourselves."

source: 子曰：「事父母幾諫；見志不從，又敬而不違，勞而不怨。」
en: The Master said, "In serving his parents, a son may remonstrate with them, but gently; when he sees that they do not incline to follow his advice, he shows an increased degree of reverence, but does not abandon his purpose; and should they punish him, he does not allow himself to murmur."

source: 子曰：「父母在，不遠遊；遊必有方。」
en: The Master said, "While his parents are alive, the son may not go abroad to a distance. If he does go abroad, he must have a fixed place to which he goes."

source: 子曰：「三年無改於父之道，可謂孝矣。」
en: The Master said, "If the son for three years does not alter from the way of his father, he may be called filial."

source: 子曰：「父母之年，不可不知也。一則以喜，一則以懼。」
en: The Master said, "The years of parents may by no means not be kept in the memory, as an occasion at once for joy and for fear."

source: 子曰：「古者言之不出，恥躬之不逮也。」
en: The Master said, "The reason why the ancients did not readily give utterance to their words, was that they feared lest their actions should not come up to them."

source: 子曰：「以約失之者，鮮矣。」
en: The Master said, "The cautious seldom err."

source: 子曰：「君子欲訥於言而敏於行。」
en: The Master said, "The superior man wishes to be slow in his speech and earnest in his conduct."

source: 子曰：「德不孤，必有鄰。」
en: The Master said, "Virtue is not left to stand alone. He who practises it will have neighbors."

source: 子游曰：「事君數，斯辱矣。朋友數，斯疏矣。」===校勘記===
en: Tsze-yu said, "In serving a prince, frequent remonstrances lead to disgrace. Between friends, frequent reproofs make the friendship distant."

source: 子謂公冶長，「可妻也；雖在縲絏之中，非其罪也。」以其子妻之。
en: The Master said of Kung-ye Ch'ang that he might be wived; although he was put in bonds, he had not been guilty of any crime. Accordingly, he gave him his own daughter to wife.

source: 子謂南容，「邦有道，不廢；邦無道，免於刑戮。」以其兄之子妻之。
en: Of Nan Yung he said that if the country were well governed he would not be out of office, and if it were ill-governed, he would escape punishment and disgrace. He gave him the daughter of his own elder brother to wife.

source: 子謂子賤：「君子哉若人！魯無君子者，斯焉取斯？」
en: The Master said of Tsze-chien, "Of superior virtue indeed is such a man! If there were not virtuous men in Lu, how could this man have acquired this character?"

source: 子貢問曰：「賜也何如？」子曰：「女器也」。曰：「何器也？」曰：「瑚璉也。」
en: Tsze-kung asked, "What do you say of me, Ts'ze? The Master said, "You are a utensil." "What utensil?" "A gemmed sacrificial utensil."

source: 或曰：「雍也，仁而不佞。」子曰：「焉用佞？禦人以口給，屢憎於人。不知其仁；焉用佞？」
en: Some one said, "Yung is truly virtuous, but he is not ready with his tongue." The Master said, "What is the good of being ready with the tongue? They who encounter men with smartnesses of speech for the most part procure themselves hatred. I know not whether he be truly virtuous, but why should he show readiness of the tongue?"

source: 子使漆雕開仕。對曰：「吾斯之未能信。」子說。
en: The Master was wishing Ch'i-tiao K'ai to enter on official employment. He replied, "I am not yet able to rest in the assurance of THIS." The Master was pleased.

source: 子曰：「道不行，乘桴浮於海，從我者，其由與？」子路聞之喜。子曰：「由也，好勇過我，無所取材。」
en: The Master said, "My doctrines make no way. I will get upon a raft, and float about on the sea. He that will accompany me will be Yu, I dare say." Tsze-lu hearing this was glad, upon which the Master said, "Yu is fonder of daring than I am. He does not exercise his judgment upon matters."

source: 孟武伯問：「子路仁乎？」子曰：「不知也。」又問，子曰：「由也，千乘之國，可使治其賦也；不知其仁也。」「求也何如？」子曰：「求也，千室之邑，百乘之家，可使爲之宰也；不知其仁也。」「赤也何如？」子曰：「赤也，束帶立於朝，可使與賓客言也；不知其仁也。」
en: Mang Wu asked about Tsze-lu, whether he was perfectly virtuous. The Master said, "I do not know." He asked again, when the Master replied, "In a kingdom of a thousand chariots, Yu might be employed to manage the military levies, but I do not know whether he be perfectly virtuous." "And what do you say of Ch'iu?" The Master replied, "In a city of a thousand families, or a clan of a hundred chariots, Ch'iu might be employed as governor, but I do not know whether he is perfectly virtuous." "What do you say of Ch'ih?" The Master replied, "With his sash girt and standing in a court, Ch'ih might be employed to converse with the visitors and guests, but I do not know whether he is perfectly virtuous."

source: 子謂子貢曰：「女與回也孰愈？」對曰：「賜也何敢望回！回也聞一以知十，賜也聞一以知二。」子曰：「弗如也。吾與女，弗如也。」
en: The Master said to Tsze-kung, "Which do you consider superior, yourself or Hui?" Tsze-kung replied, "How dare I compare myself with Hui? Hui hears one point and knows all about a subject; I hear one point, and know a second." The Master said, "You are not equal to him. I grant you, you are not equal to him."

source: 宰予晝寢。子曰：「朽木不可雕也，糞土之牆，不可杇也；於予與何誅！」子曰：「始吾於人也，聽其言而信其行；今吾於人也，聽其言而觀其行；於予與改是。」
en: Tsai Yu being asleep during the daytime, the Master said, "Rotten wood cannot be carved; a wall of dirty earth will not receive the trowel. This Yu!—what is the use of my reproving him?" The Master said, "At first, my way with men was to hear their words, and give them credit for their conduct. Now my way is to hear their words, and look at their conduct. It is from Yu that I have learned to make this change."

source: 子曰：「吾未見剛者。」或對曰：「申棖。」子曰：「棖也慾！焉得剛？」
en: The Master said, "I have not seen a firm and unbending man." Some one replied, "There is Shan Ch'ang." "Ch'ang," said the Master, "is under the influence of his passions; how can he be pronounced firm and unbending?"

source: 子貢曰：「我不欲人之加諸我也，吾亦欲無加諸人。」子曰：「賜也，非爾所及也！」
en: Tsze-kung said, "What I do not wish men to do to me, I also wish not to do to men." The Master said, "Ts'ze, you have not attained to that."

source: 子貢曰：「夫子之文章，可得而聞也；夫子之言性與天道，不可得而聞也。」
en: Tsze-kung said, "The Master's personal displays of his principles and ordinary descriptions of them may be heard. His discourses about man's nature, and the way of Heaven, cannot be heard."

source: 子路有聞，未之能行，唯恐有聞。
en: When Tsze-lu heard anything, if he had not yet succeeded in carrying it into practice, he was only afraid lest he should hear something else.

source: 子貢問曰：「孔文子，何以謂之文也？」子曰：「敏而好學，不恥下問，是以謂之文也。」
en: Tsze-kung asked, saying, "On what ground did Kung-wan get that title of Wan?" The Master said, "He was of an active nature and yet fond of learning, and he was not ashamed to ask and learn of his inferiors!—On these grounds he has been styled Wan."

source: 子謂子產：「有君子之道四焉：其行己也恭，其事上也敬，其養民也惠，其使民也義。」
en: The Master said of Tsze-ch'an that he had four of the characteristics of a superior man:—in his conduct of himself, he was humble; in serving his superiors, he was respectful; in nourishing the people, he was kind; in ordering the people, he was just."

source: 子曰：「晏平仲善與人交，久而敬之。」
en: The Master said, "Yen P'ing knew well how to maintain friendly intercourse. The acquaintance might be long, but he showed the same respect as at first."

source: 子曰：「臧文仲居蔡，山節藻梲。何如其知也？」
en: The Master said, "Tsang Wan kept a large tortoise in a house, on the capitals of the pillars of which he had hills made, and with representations of duckweed on the small pillars above the beams supporting the rafters.—Of what sort was his wisdom?"

source: 子張問曰：「令尹子文，三仕爲令尹，無喜色；三已之，無慍色。舊令尹之政，必以吿新令尹。何如？」子曰：「忠矣。」曰：「仁矣乎？」曰：「未知，焉得仁？」「崔子弒齊君，陳文子有馬十乘，棄而違之，至於他邦，則曰：『猶吾大夫崔子也！』違之，之一邦，則又曰：『猶吾大夫崔子也！』違之。何如？」子曰：「淸矣。」曰：「仁矣乎？」曰：「未知，焉得仁？」
en: Tsze-chang asked, saying, "The minister Tsze-wan thrice took office, and manifested no joy in his countenance. Thrice he retired from office, and manifested no displeasure. He made it a point to inform the new minister of the way in which he had conducted the government;—what do you say of him?" The Master replied. "He was loyal." "Was he perfectly virtuous?" "I do not know. How can he be pronounced perfectly virtuous?" Tsze-chang proceeded, "When the officer Ch'ui killed the prince of Ch'i, Ch'an Wan, though he was the owner of forty horses, abandoned them and left the country. Coming to another State, he said, 'They are here like our great officer, Ch'ui,' and left it. He came to a second State, and with the same observation left it also;—what do you say of him?" The Master replied, "He was pure." "Was he perfectly virtuous?" "I do not know. How can he be pronounced perfectly virtuous?"

source: 季文子三思而後行。子聞之曰：「再，斯可矣！」
en: Chi Wan thought thrice, and then acted. When the Master was informed of it, he said, "Twice may do."

source: 子曰：「甯武子，邦有道則知；邦無道則愚。其知可及也，其愚不可及也。」
en: The Master said, "When good order prevailed in his country, Ning Wu acted the part of a wise man. When his country was in disorder, he acted the part of a stupid man. Others may equal his wisdom, but they cannot equal his stupidity."

source: 子在陳，曰：「歸與！歸與！吾黨之小子狂簡，斐然成章，不知所以裁之。」
en: When the Master was in Ch'an, he said, "Let me return! Let me return! The little children of my school are ambitious and too hasty. They are accomplished and complete so far, but they do not know how to restrict and shape themselves."

source: 子曰：「伯夷、叔齊，不念舊惡，怨是用希。」
en: The Master said, "Po-i and Shu-ch'i did not keep the former wickednesses of men in mind, and hence the resentments directed towards them were few."

source: 子曰：「孰謂微生高直？或乞醯焉，乞諸其鄰而與之。」
en: The Master said, "Who says of Wei-shang Kao that he is upright? One begged some vinegar of him, and he begged it of a neighbor and gave it to the man."

source: 子曰：「巧言、令色、足恭，左丘明恥之，丘亦恥之。匿怨而友其人，左丘明恥之，丘亦恥之。」
en: The Master said, "Fine words, an insinuating appearance, and excessive respect;—Tso Ch'iu-ming was ashamed of them. I also am ashamed of them. To conceal resentment against a person, and appear friendly with him;—Tso Ch'iu-ming was ashamed of such conduct. I also am ashamed of it."

source: 顏淵、季路侍。子曰：「盍各言爾志？」子路曰：「願車馬衣裘，與朋友共，敝之而無憾。」顏淵曰：「願無伐善，無施勞。」子路曰：「願聞子之志。」子曰：「老者安之，朋友信之，少者懷之。」
en: Yen Yuan and Chi Lu being by his side, the Master said to them, "Come, let each of you tell his wishes." Tsze-lu said, "I should like, having chariots and horses, and light fur dresses, to share them with my friends, and though they should spoil them, I would not be displeased." Yen Yuan said, "I should like not to boast of my excellence, nor to make a display of my meritorious deeds." Tsze-lu then said, "I should like, sir, to hear your wishes." The Master said, "They are, in regard to the aged, to give them rest; in regard to friends, to show them sincerity; in regard to the young, to treat them tenderly."

source: 子曰：「已矣乎！吾未見能見其過，而內自訟者也。」
en: The Master said, "It is all over! I have not yet seen one who could perceive his faults, and inwardly accuse himself."

source: 子曰：「十室之邑，必有忠信如丘者焉，不如丘之好學也。」
en: The Master said, "In a hamlet of ten families, there may be found one honourable and sincere as I am, but not so fond of learning."

source: 子曰：「雍也，可使南面。」仲弓問子桑伯子。子曰：「可也，簡。」仲弓曰：「居敬而行簡，以臨其民，不亦可乎？居簡而行簡，無乃大簡乎？」子曰：「雍之言然。」
en: The Master said, "There is Yung!—He might occupy the place of a prince." Chung-kung asked about Tsze-sang Po-tsze. The Master said, "He may pass. He does not mind small matters." Chung-kung said, "If a man cherish in himself a reverential feeling of the necessity of attention to business, though he may be easy in small matters in his government of the people, that may be allowed. But if he cherish in himself that easy feeling, and also carry it out in his practice, is not such an easy mode of procedure excessive?" The Master said, "Yung's words are right."

source: 哀公問：「弟子孰爲好學？」孔子對曰：「有顏回者，好學；不遷怒，不貳過，不幸短命死矣！今也則亡，未聞好學者也。」
en: The Duke Ai asked which of the disciples loved to learn. Confucius replied to him, "There was Yen Hui; he loved to learn. He did not transfer his anger; he did not repeat a fault. Unfortunately, his appointed time was short and he died; and now there is not such another. I have not yet heard of any one who loves to learn as he did."

source: 子華使於齊，冉子爲其母請粟。子曰：「與之釜。」請益，曰：「與之庾。」冉子與之粟五秉。子曰：「赤之適齊也，乘肥馬，衣輕裘；吾聞之也：君子周急不繼富。」原思爲之宰，與之粟九百，辭。子曰：「毋！以與爾鄰里鄉黨乎！」
en: Tsze-hwa being employed on a mission to Ch'i, the disciple Zan requested grain for his mother. The Master said, "Give her a fu." Yen requested more. "Give her an yu," said the Master. Yen gave her five ping. The Master said, "When Ch'ih was proceeding to Ch'i, he had fat horses to his carriage, and wore light furs. I have heard that a superior man helps the distressed, but does not add to the wealth of the rich." Yuan Sze being made governor of his town by the Master, he gave him nine hundred measures of grain, but Sze declined them. The Master said, "Do not decline them. May you not give them away in the neighborhoods, hamlets, towns, and villages?"

source: 子謂仲弓曰：「犁牛之子，騂且角；雖欲勿用，山川其舍諸？」
en: The Master, speaking of Chung-kung, said, "If the calf of a brindled cow be red and horned, although men may not wish to use it, would the spirits of the mountains and rivers put it aside?"

source: 子曰：「回也，其心三月不違仁。其餘，則日月至焉而已矣。」
en: The Master said, "Such was Hui that for three months there would be nothing in his mind contrary to perfect virtue. The others may attain to this on some days or in some months, but nothing more."

source: 季康子問：「仲由可使從政也與？」子曰：「由也果，於從政乎何有！」曰：「賜也可使從政也與？」曰：「賜也達，於從政乎何有！」曰：「求也可使從政也與？」曰：「求也藝，於從政乎何有！」
en: Chi K'ang asked about Chung-yu, whether he was fit to be employed as an officer of government. The Master said, "Yu is a man of decision; what difficulty would he find in being an officer of government?" K'ang asked, "Is Ts'ze fit to be employed as an officer of government?" and was answered, "Ts'ze is a man of intelligence; what difficulty would he find in being an officer of government?" And to the same question about Ch'iu the Master gave the same reply, saying, "Ch'iu is a man of various ability."

source: 季氏使閔子騫爲費宰。閔子騫曰：「善爲我辭焉。如有復我者，則吾必在汶上矣。」
en: The chief of the Chi family sent to ask Min Tsze-ch'ien to be governor of Pi. Min Tsze-ch'ien said, "Decline the offer for me politely. If any one come again to me with a second invitation, I shall be obliged to go and live on the banks of the Wan."

source: 伯牛有疾，子問之，自牖執其手，曰：「亡之，命矣夫！斯人也，而有斯疾也！斯人也，而有斯疾也！」
en: Po-niu being ill, the Master went to ask for him. He took hold of his hand through the window, and said, "It is killing him. It is the appointment of Heaven, alas! That such a man should have such a sickness! That such a man should have such a sickness!"

source: 子曰：「賢哉回也！一簞食，一瓢飮，在陋巷，人不堪其憂，回也不改其樂。賢哉回也！」
en: The Master said, "Admirable indeed was the virtue of Hui! With a single bamboo dish of rice, a single gourd dish of drink, and living in his mean narrow lane, while others could not have endured the distress, he did not allow his joy to be affected by it. Admirable indeed was the virtue of Hui!"

source: 冉求曰：「非不說子之道，力不足也。」子曰：「力不足者，中道而廢；今女畫。」
en: Yen Ch'iu said, "It is not that I do not delight in your doctrines, but my strength is insufficient." The Master said, "Those whose strength is insufficient give over in the middle of the way but now you limit yourself."

source: 子謂子夏曰：「女爲君子儒，無爲小人儒。」註解：「女」有「汝、你」的意思。本句文意是「孔子給學生子夏的期許，希望子夏能做大事，不做計算小事的儒者。」
en: The Master said to Tsze-hsia, "Do you be a scholar after the style of the superior man, and not after that of the mean man."

source: 子游爲武城宰。子曰：「女得人焉耳乎？」曰：「有澹臺滅明者，行不由徑；非公事，未嘗至於偃之室也。」
en: Tsze-yu being governor of Wu-ch'ang, the Master said to him, "Have you got good men there?" He answered, "There is Tan-t'ai Mieh-ming, who never in walking takes a short cut, and never comes to my office, excepting on public business."

source: 子曰：「孟之反不伐，奔而殿，將入門，策其馬，曰：『非敢後也，馬不進也。』」
en: The Master said, "Mang Chih-fan does not boast of his merit. Being in the rear on an occasion of flight, when they were about to enter the gate, he whipped up his horse, saying, 'It is not that I dare to be last. My horse would not advance.'"

source: 子曰：「不有祝鮀之佞，而有宋朝之美，難乎免於今之世矣。」
en: The Master said, "Without the specious speech of the litanist T'o and the beauty of the prince Chao of Sung, it is difficult to escape in the present age."

source: 子曰：「誰能出不由戶？何莫由斯道也！」
en: The Master said, "Who can go out but by the door? How is it that men will not walk according to these ways?"

source: 子曰：「質勝文則野，文勝質則史。文質彬彬，然後君子。」
en: The Master said, "Where the solid qualities are in excess of accomplishments, we have rusticity; where the accomplishments are in excess of the solid qualities, we have the manners of a clerk. When the accomplishments and solid qualities are equally blended, we then have the man of virtue."

source: 子曰：「人之生也直，罔之生也幸而免。」
en: The Master said, "Man is born for uprightness. If a man lose his uprightness, and yet live, his escape from death is the effect of mere good fortune."

source: 子曰：「知之者，不如好之者，好之者，不如樂之者。」
en: The Master said, "They who know the truth are not equal to those who love it, and they who love it are not equal to those who delight in it."

source: 子曰：「中人以上，可以語上也；中人以下，不可以語上也。」
en: The Master said, "To those whose talents are above mediocrity, the highest subjects may be announced. To those who are below mediocrity, the highest subjects may not be announced."

source: 樊遲問知。子曰：「務民之義，敬鬼神而遠之，可謂知矣。」問仁。曰：「仁者先難而後獲，可謂仁矣。」
en: Fan Ch'ih asked what constituted wisdom. The Master said, "To give one's self earnestly to the duties due to men, and, while respecting spiritual beings, to keep aloof from them, may be called wisdom." He asked about perfect virtue. The Master said, "The man of virtue makes the difficulty to be overcome his first business, and success only a subsequent consideration;—this may be called perfect virtue."

source: 子曰：「知者樂水，仁者樂山。知者動，仁者靜。知者樂，仁者壽。」
en: The Master said, "The wise find pleasure in water; the virtuous find pleasure in hills. The wise are active; the virtuous are tranquil. The wise are joyful; the virtuous are long-lived."

source: 子曰：「齊一變，至於魯；魯一變，至於道。」
en: The Master said, "Ch'i, by one change, would come to the State of Lu. Lu, by one change, would come to a State where true principles predominated."

source: 子曰：「觚不觚，觚哉！觚哉！」
en: The Master said, "A cornered vessel without corners.—A strange cornered vessel! A strange cornered vessel!"

source: 宰我問曰：「仁者雖吿之曰：『井有仁焉。』其從之也？」子曰：「何爲其然也？君子可逝也，不可陷也。可欺也，不可罔也。」
en: Tsai Wo asked, saying, "A benevolent man, though it be told him,—"There is a man in the well" will go in after him, I suppose." Confucius said, "Why should he do so?" A superior man may be made to go to the well, but he cannot be made to go down into it. He may be imposed upon, but he cannot be fooled."

source: 子曰：「君子博學於文，約之以禮，亦可以弗畔矣夫！」
en: The Master said, "The superior man, extensively studying all learning, and keeping himself under the restraint of the rules of propriety, may thus likewise not overstep what is right."

source: 子見南子，子路不說。夫子矢之曰：「予所否者，天厭之！天厭之！」
en: The Master having visited Nan-tsze, Tsze-lu was displeased, on which the Master swore, saying, "Wherein I have done improperly, may Heaven reject me, may Heaven reject me!"

source: 子曰：「中庸之爲德也，其至矣乎！民鮮久矣！」
en: The Master said, "Perfect is the virtue which is according to the Constant Mean! Rare for a long time has been its practise among the people."

source: 子貢曰：「如有博施於民，而能濟眾，何如？可謂仁乎？」子曰：「何事於仁，必也聖乎？堯舜其猶病諸！夫仁者，己欲立而立人，己欲達而達人。能近取譬，可謂仁之方也已。」
en: Tsze-kung said, "Suppose the case of a man extensively conferring benefits on the people, and able to assist all, what would you say of him? Might he be called perfectly virtuous?" The Master said, "Why speak only of virtue in connexion with him? Must he not have the qualities of a sage? Even Yao and Shun were still solicitous about this. "Now the man of perfect virtue, wishing to be established himself, seeks also to establish others; wishing to be enlarged himself, he seeks also to enlarge others. "To be able to judge of others by what is nigh in ourselves;—this may be called the art of virtue."

source: 子曰：「述而不作，信而好古，竊比於我老彭。」
en: The Master said, "A transmitter and not a maker, believing in and loving the ancients, I venture to compare myself with our old P'ang."

source: 子曰：「默而識之，學而不厭，誨人不倦，何有於我哉？」
en: The Master said, "The silent treasuring up of knowledge; learning without satiety; and instructing others without being wearied:—which one of these things belongs to me?"

source: 子曰：「德之不脩，學之不講，聞義不能徙，不善不能改，是吾憂也。」
en: The Master said, "The leaving virtue without proper cultivation; the not thoroughly discussing what is learned; not being able to move towards righteousness of which a knowledge is gained; and not being able to change what is not good:—these are the things which occasion me solicitude."

source: 子之燕居，申申如也，夭夭如也。
en: When the Master was unoccupied with business, his manner was easy, and he looked pleased.

source: 子曰：「甚矣，吾衰也！久矣，吾不復夢見周公！」
en: The Master said, "Extreme is my decay. For a long time, I have not dreamed, as I was wont to do, that I saw the duke of Chau."

source: 子曰：『志於道，狎於德，依於仁，游於藝。』
en: The Master said, "Let the will be set on the path of duty. "Let every attainment in what is good be firmly grasped. "Let perfect virtue be accorded with. "Let relaxation and enjoyment be found in the polite arts."

source: 子曰：「自行束脩以上，吾未嘗無誨焉。」
en: The Master said, "From the man bringing his bundle of dried flesh for my teaching upwards, I have never refused instruction to any one."

source: 子曰：「不憤不啟；不悱不發。擧一隅，不以三隅反，則不復也。」
en: The Master said, "I do not open up the truth to one who is not eager to get knowledge, nor help out any one who is not anxious to explain himself. When I have presented one corner of a subject to any one, and he cannot from it learn the other three, I do not repeat my lesson."

source: 子食於有喪者之側，未嘗飽也。子於是日哭，則不歌。
en: When the Master was eating by the side of a mourner, he never ate to the full. He did not sing on the same day in which he had been weeping.

source: 子謂顏淵曰：「用之則行，舍之則藏。惟我與爾有是夫！」子路曰：「子行三軍，則誰與？」子曰：「暴虎馮河，死而無悔者，吾不與也。必也臨事而懼，好謀而成者也。」
en: The Master said to Yen Yuan, "When called to office, to undertake its duties; when not so called, to lie retired;—it is only I and you who have attained to this." Tsze-lu said, "If you had the conduct of the armies of a great State, whom would you have to act with you?" The Master said, "I would not have him to act with me, who will unarmed attack a tiger, or cross a river without a boat, dying without any regret. My associate must be the man who proceeds to action full of solicitude, who is fond of adjusting his plans, and then carries them into execution."

source: 子曰：「富而可求也，雖執鞭之士，吾亦爲之；如不可求，從吾所好。」
en: The Master said, "If the search for riches is sure to be successful, though I should become a groom with whip in hand to get them, I will do so. As the search may not be successful, I will follow after that which I love."

source: 子之所愼：齊、戰、疾。
en: The things in reference to which the Master exercised the greatest caution were —fasting, war, and sickness.
